---
kind: other
id: Properties.T:Autodesk.Revit.DB.DisableAnalyticalModelCB
source: html/ba4c879d-22a1-0279-48c3-23bfc51e4695.htm
---
# DisableAnalyticalModelCB Properties

Specifies whether the .NET object represents a valid Revit entity.